Revit 2027 API
IViewSheetSet.SheetOrganizationId Property
ElementId to the BrowserOrganization for sheets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
ElementId SheetOrganizationId { get; set; }
Property SheetOrganizationId As ElementId
	Get
	Set
property ElementId^ SheetOrganizationId {
	ElementId^ get ();
	void set (ElementId^ value);
}
abstract SheetOrganizationId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  Thrown when the ElementId does not reference to BrowserOrganization, or the target type of BrowserOrganization is incompatible.
See Also
Reference
IViewSheetSet Interface
Autodesk.Revit.DB Namespace